Revit 2024 API
DuctSizeSettingIterator.HasCurrent Method
 Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasCurrent()
Visual Basic
Public Function HasCurrent As Boolean
Visual C++
public:
bool HasCurrent()
Return Value
 True if there is a current item.
See Also
DuctSizeSettingIterator Class
Autodesk.Revit.DB.Mechanical Namespace